Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/older_and_retired_people/income_supports_for_older_people.html.txt.tmx
Source language: en
Languages: ga

source: Income supports for older people
ga: Fordheontais ioncaim do dhaoine aosta

source: A range of payments are made to older people by the Department of Social Protection and the Health Service Executive
ga: Tá raon d'íocaíochtaí ann a dhéanann an Roinn Coimirce Sóisialaí agus Feidhmeannacht na Seirbhíse Sláinte le daoine aosta

source: If you are unsure whether or not you would qualify for a payment, you should apply anyway
ga: Mura bhfuil tú cinnte an mbeifeá incháilithe íocaíocht a fháil, cuir iarratas isteach ar aon nós

source: Generally payments are made up of a personal payment for yourself and extra amounts for your dependent spouse, civil partner or cohabitant and any dependent children
ga: Tá roinnt íocaíochtaí árachais shóisialta agus tástála acmhainne ar fáil do dhaoine aosta

source: A cohabitant is a person living in an intimate and committed relationship with a person of the same or opposite sex who is not that person’s spouse, civil partner, or a close relative
ga: Go ginearálta tá íocaíochtaí déanta suas d’íocaíocht phearsanta duit féin agus méideanna breise do do chéile cleithiúnach/páirtnéir sibhialta/comhchónatheoir agus leanaí cleithiúnacha ar bith

source: You should apply to the Department of Social Protection for your pension at least four months in advance
ga: Is comhchónatheoir duine a chónaíonn i gcaidreamh caidreamhach agus domhain le duine den ghnéas céanna nó den ghnéas eile nach céile, páirtnéir sibhialta, nó muintir an duine sin é/í

source: Changes to the qualifying age for State pensions
ga: Athruithe ar an aois cháilitheach do na pinsin Stáit

source: The Social Welfare and Pensions Act 2011 made a number of changes to the qualifying age for State pensions
ga: Rinne an tAcht Leasa Shóisialaigh agus Pinsean 2011 roinnt athruithe ar an aois cháilitheach do na pinsin Stáit

source: Since 2014, the qualifying age has been 66 and will rise to 67 in 2021 and 68 in 2028. So:
ga: Beidh an aois cháilitheach ardaithe go dtí 66 bliain I 2014, 67 bliain i 2021 agus 68 bliain i 2028 mar a leanas:

source: • If you were born on or after 1 January 1948 the minimum qualifying State pension age will be 66 (because the State Pension (Transition) is no longer paid)
ga: • Má saolaíodh tú an 1 Eanáir 1948 nó ina dhiaidh ní cháileoidh tú don Phinsean Stáit go dtí go mbeidh tú 66 bliain ar a laghad. (Ní íocfar an Pinsean Stáit (Eatramhach) a thuilleadh ó 1 Eanáir 2014.)

source: • If you were born on or after 1 January 1955 the minimum qualifying State pension age will be 67
ga: • Má saolaíodh tú an 1 Eanáir 1955 nó ina dhiaidh ní cháileoidh tú don Pinsean Stáit go dtí go mbeidh tú 67 bliain ar a laghad

source: • If you were born on or after 1 January 1961 the minimum qualifying State pension age will be 68
ga: • Má saolaíodh tú an 1 Eanáir 1961 nó ina dhiaidh ní cháileoidh tú don Pinsean Stáit go dtí go mbeidh tú 68 bliain ar a laghad

source: You need enough PRSI contributions to qualify for these payments
ga: Teastaíonn ranníocaíochtaí ÁSPC imleora le bheith incháilithe na híocaíochtaí a fháil

source: Apply to the Department of Social Protection
ga: Cuir iarratas isteach don Roinn Coimirce Sóisialaí

source: Since 1 January 2014 the State Pension (Transition) is no longer paid to new applicants
ga: Ní íocfar an Pinsean Stáit (Eatramhach) a thuilleadh ó 1 Eanáir 2014

source: This means that there is a standard State Pension age of 66 years for everyone
ga: Ciallaíonn sé go mbeidh aois an Phinsin Stáit caighdeánach 66 bliain do gach duine

source: The State Pension (Contributory) is payable from the age of 66
ga: Tá sé seo iníoctha do dhaoine 66 bliana d’aois nó níos sine

source: You are allowed to have income from any other source while you receive this pension, but both the income and the pension are taxable
ga: Is féidir leat ioncam a bheith agat ó aon fhoinse eile nuair a fhaigheann tú an pinsean seo, ach is féidir cáin a ghearradh ar an ioncam agus ar an bpinsean araon

source: There are a number of pro-rata State Pensions (Contributory) which are paid at a lower rate
ga: Tá roinnt Pinsin Stáit (Ranníocach) Pro-Rata a íoctar ag ráta níos ísle

source: Under the National Pensions Framework a number of other changes are planned to the qualifying conditions for the State Pension (Contributory) from 2020
ga: De réir an Chreata Náisiúnta Pinsean tá roinnt athruithe ar na coinníollacha cáilitheacha don Phinsean Stáit (Ranníocach) beartaithe ó 2020

source: These changes do not affect the State Pension (Non-Contributory)
ga: Ní théann na hathruithe seo i bhfeidhm ar an bPinsean Stáit (Neamhranníocach)

source: Widow's, Widower's or Surviving Civil Partner's Contributory Pension
ga: Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: You may be eligible for Widow’s, Widower’s or Surviving Civil Partner's Contributory Pension if you are widowed or a surviving civil partner, have not remarried or entered into a new civil partnership, and are not cohabiting
ga: Féadfaidh tú a bheith incháilithe Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) a fháil, más baintreach nó bainteach fir nó páirtnéir sibhialta marthanach tú, mura bpós tú arís nó mura bhfuil tú i bpáirtnéireacht shibhialta nua, agus mura bhfuil tú ag maireachtáil le duine eile

source: You can transfer to the State Pension (Contributory) at the age of 66
ga: Is féidir leat aistriú go dtí an Pinsean Stáit (idirthréimhseach) ag 65 bliana d’aois nó go dtí an Pinsean Stáit (Ranníocach) ag 66 bliana d’aois

source: Any means you may have, such as weekly income or savings, are taken into account for these payments, but not your own home
ga: Cuirtear aon acmhainní a d’fheadfadh a bheith agat san áireamh, amhail ioncam seachtainiúil nó coigilteas, maidir leis na híocaíochtaí seo ach ní do bhaile féin

source: You must also satisfy the habitual residence condition
ga: Cuir iarratas isteach don Roinn Coimirce Sóisialaí

source: The State Pension (Non-Contributory) is a payment for people aged 66 or over who do not qualify for a State Pension (Contributory)
ga: Seo íocaíocht do dhaoine 66 bliana d’aois nó níos sine nach bhfuil incháilithe Pinsean Stáit (Ranníocach) a fháil

source: Widow’s, Widower’s or Surviving Civil Partner's Non-Contributory Pension
ga: Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach)

source: If you are a widowed person or a surviving civil partner who is not entitled to a Widow’s, Widower’s or Surviving Civil Partner's Contributory Pension, has not remarried or entered into a new civil partnership, has no dependent children and is not cohabiting, you may be eligible for a Widow's, Widower's or Surviving Civil Partner's Non-Contributory Pension. This is a means-tested payment
ga: Más baintreach, baintreach fir, nó páirtnéir sibhialta thú nach bhfuil i dteideal Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) a fháil, nár phós arís nó nach bhfuil i bpáirtnéireacht shibhialta, nach bhfuil páistí cleithiúnacha agat agus nach bhfuil ag maireachtáil le duine eile, féadfaidh tú a bheith incháilithe Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach) a fháil

source: At age 66 you transfer to the State Pension (Non-Contributory)
ga: Ag 66 bliana d'aois aistríonn tú go dtí an Pinsean Stáit (Neamhranníocach)

source: Occupational and personal pensions
ga: Pinsin cheirde agus phearsanta

source: Occupational pensions are organised by employers to provide pensions to employees on retirement or to surviving dependants on the death of an employee
ga: Eagraíonn fostóirí pinsin cheirde chun pinsin a sholáthar d’fhostaithe a imíonn ar scor nó do chleithiúnaithe a mhaireann tar éis bhás an fhostaí

source: Personal pensions or Personal Retirement Savings Accounts (PRSAs) are organised individually by self-employed people or employed people who do not have an occupational pension scheme
ga: Eagraíonn daoine féinfhostaithe nó fostaithe nach bhfuil scéim pinsin cheirde acu pinsin phearsanta nó Cuntais Choigiltis Scoir Phearsanta (CCSP) ina n-aonar

source: You need to deal directly with the pension provider to find out exactly what benefits your pension gives you
ga: Caithfidh tú déileáil go díreach leis an soláthraí pinsin le fáil amach go díreach faoi na sochair a sholáthraíonn an pinsean duit

source: The Pensions Authority is the regulatory body for occupational pensions and PRSAs
ga: Is é an Bord Pinsean an comhlacht rialála maidir le pinsin cheirde agus CCSP

source: If you have a complaint, the Authority will advise you about your rights
ga: Má tá gearán agat, tabharfaidh an Bord comhairle duit maidir le do chearta

source: The Pensions Ombudsman investigates and decides on complaints relating to occupational pensions and PRSAs
ga: Déanann Ombudsman na bPinsean iniúchadh agus cinneadh ar ghearáin a bhaineann le pinsin cheirde agus CCSP

source: Generally, you may have income from other sources, for example, from work, if you are receiving a pension
ga: Go ginearálta, d’fhéadfadh sé go mbeadh ioncam agat ó fhoinsí eile, mar shampla, ó obair, má fhaigheann tú pinsean

source: There are some restrictions on people getting both a pension and employment income from the public sector – you should check with the pension provider
ga: Tá srianta áirithe ar dhaoine a fhaigheann pinsean agus ioncaim ó fhostaíocht araon ón earnáil phoiblí - ba chóir duit seiceáil leis an soláthraí pinsin

source: Other social welfare payments
ga: Íocaíochtaí leasa shóisialaigh eile

source: Apply to the Department of Social Protection for these payments
ga: Cuir iarratas isteach ar an Roinn Coimirce Sóisialaí maidir leis na híocaíochtaí seo

source: The Increase for Living Alone is a supplementary payment for people in Ireland on Irish social welfare pensions who are living alone
ga: Is íocaíocht fhorlíontach é an Liúntas Cónaithe Aonair do dhaoine in Éirinn ar phinsin leasa shóisialaigh atá ag maireachtáil ina n-aonar

source: It is also available to people under the age of 66 who get certain other payments from the Department of Social Protection
ga: Tá sí ar fáil freisin do dhaoine faoi bhun 66 bliana d’aois a fhaigheann íocaíochtaí áirithe eile ón Roinn Coimirce Sóisialaí

source: If you are getting an Irish social welfare pension, you automatically get an increase in your pension when you reach 80 years of age
ga: Má fhaigheann tú pinsean leasa shóisialaigh Éireannach, faigheann tú méadú ar do phinsean go huathoibríoch nuair a bhaineann tú 80 bliana d’aois amach

source: Increase for Living on a Specified Island
ga: Méadú maidir le maireachtáil ar Oileán Sainithe

source: This is an increase in the weekly payment of certain payments from the DSP, or the EU equivalent, to people who are aged 66 or over and living on a specified island off the coast of Ireland
ga: Seo méadú ar íocaíocht sheachtainiúil íocaíochtaí áirithe ón RGST, nó a coibhéis AE, do dhaoine atá 66 bliana d’aois nó níos sine atá ag maireachtáil ar oileán sainithe amach ó chósta na hÉireann

source: The Increase for Living on a Specified Island is to compensate for the additional costs of living on these islands compared to living on the mainland
ga: Is é cuspóir na scéime ná cúiteamh a dhéanamh as na costais bhreise a bhaineann le maireachtáil ar na hoileáin seo curtha i gcomparáid le maireachtáil ar an mórthír

source: The Household Benefits Package includes the Electricity or Natural Gas Allowance and a Free TV Licence (the Telephone Allowance was discontinued in 2014)
ga: Cuimsíonn an Pacáiste Sochair Teaghlaigh an Liúntas um Leictreachas /Ghás Nádúrtha In Aisce agus Cheadúnas Teilifíse In Aisce (Cuireadh deireadh leis an liúntas teileafóin i 2014)

source: If you are aged 70 or over, you qualify regardless of your income or who lives with you
ga: Má tá tú 70 bliana d’aois nó níos sine, tá tú incháilithe gan aird ar d’ioncam nó ar cibé duine atá ina chónaí leat

source: The scheme may also be available to people aged 66 and over who get certain social welfare payments or whose income is below certain limits
ga: Féadfar go mbeidh an scéim ar fáil do dhaoine atá 66 bliana d’aois nó níos sine a fhaigheann íocaíochtaí leasa shóisialaigh áirithe nó a bhfuil a n-ioncam faoi theorainneacha áirithe

source: If you are over the age of 66 or getting a carers' or certain other social welfare payments, you can get a Free Travel Pass, entitling you to free travel at any time on bus, road, rail and DART services operated by Bus Átha Cliath, Bus Éireann, Iarnród Éireann, LUAS services, the Aran Islands ferry service and on certain private services which have opted into the scheme
ga: Má tá tú níos sine ná 66 bliana d’aois nó má fhaigheann tú íocaíocht cúramóra nó íocaíochtaí leasa shóisialaigh áirithe eile, is féidir leat Pas Saorthaistil a fháil, a thugann an ceart duit taisteal saor in aisce am ar bith ar sheirbhísí bus, bóthair, iarnróid agus DART a oibríonn Bus Átha Cliath, Bus Éireann, Iarnród Éireann, ar sheirbhísí LUAS, ar sheirbhís farantóireachta na nOileán Árainn agus ar sheirbhísí príobháideacha áirithe a roghnaigh páirt a ghlacadh sa scéim

source: You can also use your Free Travel Pass on any of the 34 schemes under the Rural Transport Initiative
ga: Is féidir leat do Phas Saorthaistil a úsáid ar cheann ar bith de na 34 scéim faoin Tionscnamh Iompair Tuaithe

source: People who are entitled to free travel are also entitled to have their spouse/partner travel free with them or may be entitled to a Companion Pass on medical grounds
ga: Tá daoine atá i dteideal saorthaistil i dteideal freisin go dtaistileoidh a gcéile/bpáirtí leo saor in aisce nó féadfar go mbeidh siad i dteideal Pas Compánaí a fháil ar fhorais mhíochaine

source: The Free Travel Scheme also covers public transport services in Northern Ireland for people over 66 years of age. To use this service you must have a Senior SmartPass Card
ga: Ón 7 Aibreán 2007 leathnaíodh an Scéim Saorthaistil chun seirbhísí iompair phoiblí i dTuaisceart Éireann agus i bPoblacht na hÉireann a chuimsiú do shinsearaigh a chónaíonn i gceachtar den dá dhlínse

source: The National Fuel Scheme is a means-tested payment to help people who cannot afford their own heating costs
ga: Is íocaíocht de réir tástála acmhainne í an Scéim Breosla Náisiúnta le cuidiú le daoine nach bhfuil d’acmhainn acu íoc as a gcostais téimh féin

source: You may qualify if you get certain payments from the Department of Social Protection or the EU equivalent
ga: Féadfar go mbeidh tú incháilithe má fhaigheann tú íocaíochtaí áirithe ón Roinn Coimirce Sóisialaí nó a coibhéis AE

source: If you are providing full-time care to someone who is ill or incapacitated, you may qualify for a carer’s payment
ga: Má sholáthraíonn tú cúram lánaimseartha do dhuine atá breoite nó éagumasaithe, féadfar go mbeidh tú incháilithe íocaíocht cúramóra a fháil

source: More information is available in our document on payments to carers
ga: Tá níos mó eolais ar fáil inar ndoiciméad maidir le íocaíochtaí do chúramóirí

source: Housing Aid for Older People Scheme
ga: Scéim um Chúnamh Tithíochta do Dhaoine Breacaosta

source: The Housing Aid for Older People Scheme is a local authority grant used to improve homes that are below basic standards
ga: Is deontas údaráis áitiúil é an Scéim um Chúnamh Tithíochta do Dhaoine Aosta a úsáidtear chun tithe a fheabhsú atá faoi na caighdeáin bhunúsacha

source: It is targeted mainly at older people living in rural areas
ga: Tá sé dírithe ar dhaoine aosta go príomha a chónaíonn i gceantair tuaithe

source: By paying the grant the local authority aims to help the person stay in his/her own home
ga: Bíonn sé mar aidhm ag an údarás áitiúil cuidiú leis an duine fanacht ina b(h)aile seachas bogadh go tithíocht an údaráis áitiúil tríd an deontas a íoc

source: Contact your local authority
ga: Déan teagmháil le d’údarás áitiúil

source: Housing Adaptation Grant for People with a Disability
ga: Deontas Oiriúnaithe Tithe do Dhaoine faoi Mhíchumas

source: If your home needs to be adapted to enable you to continue to live there, you may qualify for a Housing Adaptation Grant for People with a Disability
ga: Má theastaíonn uait do bhaile a oiriúnú le cur ar do chumas fanacht ann, féadfar go mbeidh tú incháilithe an Deontas Oiriúnaithe Tithíochta do Dhaoine faoi Mhíchumas a fháil

source: Mobility Aids Grants Scheme
ga: An Scéim um Bailte níos Teo

source: The Mobility Aids Grant Scheme provides grants to address mobility problems in the home, for example, the grant can be used for access ramps or a stair-lift. Better Energy Warmer Homes Scheme
ga: Faoin scéim seo soláthraíonn eagraíochtaí pobalbhunaithe seirbhísí amhail insliú áiléir agus díonadh ar shéideáin do theaghlaigh ar ioncaim ísle i gcuid mhaith den tír

source: Under this scheme, services like attic insulation and draught-proofing are provided to low-income households nationwide
ga: Is féidir le critéir incháilithe na scéime a bheith difriúil i gceantair éagsúla agus uaireanta bíonn táille bheag ann

source: There is no charge. Read more about the Better Energy Warmer Homes Scheme
ga: Seiceáil le d’Ionad Faisnéise do Shaoránaigh áitiúil le sonraí a fháil faoi sholáthraithe áitiúla

source: Refuse and water charges
ga: Táillí Dramhaíola agus Uisce

source: In some local authority areas, low-income households can avail of a waiver (that is, a reduction or total exemption) on waste and water charges made by private operators and by local authorities
ga: I gceantair údarás áitiúil áirithe, is féidir le teaghlaigh ar ioncaim ísle leas a bhaint as tarscaoileadh (is é sin, laghdú nó díolúine iomlán) maidir le táillí dramhaíola agus uisce a ghearrann oibreoirí príobháideacha agus údaráis áitiúla

source: These waivers vary greatly from region to region and in some areas they are not available at all
ga: Athraíonn na tarscaoiltí seo ó réigiún go réigiún agus i gceantair áirithe ní bhíonn siad ar fáil ar chor ar bith

source: To find out if your local authority operates a waiver scheme, you should contact them directly
ga: Le fáil amach cé acu an n-oibríonn d’údarás áitiúil scéim tarscaoilte, ba chóir duit teagmháil dhíreach a dhéanamh leo

source: If you are getting a means-tested payment, working or being self-employed affects the amount of that payment
ga: Má fhaigheann tú íocaíocht de réir tástála acmhainne, bíonn tionchar ag obair nó féinfhostaíocht ar mhéid na híocaíochta sin

source: You should check with the Department of Social Protection before taking up work to see what the effect will be
ga: Ba chóir duit seiceáil a dhéanamh leis an Roinn Coimirce Sóisialaí sula dtéann tú i mbun oibre le fáil amach faoin tionchar a bheidh ann

source: You can have up to €200 earnings from insurable employment without affecting your State Pension (Non-Contributory)
ga: Is féidir leat suas le €200 a thuilleamh ó fhostaíocht inárachais gan tionchar a bheith aige ar mhéid do Phinsean Stáit (Neamhranníocach)

source: See moving from work to retirement for more information on working in retirement, income tax etc
ga: Féach ag dul ar scor ón obair le tuilleadh eolais faoi bheith ag obair ar scor, cháin ioncaim srl

source: Further information and application forms are available from your local Citizen Information Centre and the Citizens Information Phone Service at Lo-Call 0761 07 4000
ga: Tá tuilleadh Eolais agus foirmeacha iarratais ar fáil ó d’Ionad Faisnéise do Shaoránaigh áitiúil agus ón Seirbhís Teileafóin um Fhaisnéis do Shaoránaigh ar Íosghlao 0761 07 4000
